#!/usr/bin/python
# -*- coding: UTF-8 -*-

# 类型中文名称与定义的英文名称
text2tag = {}

# 第一批数据的标注类型
tags_=['不良反应-症状', '相互作用-结果', '相互作用-药品类别', '相互作用-药品名称', '适应症-诊断', '不良反应-引发疾病',
      '药物禁忌-禁用', '药物禁忌-慎用', '规格', '注意事项-检验相关', '用法用量-给药途径', '用法用量-每次剂量', '注意事项-操作',
      '用法用量-给药频次', '用法用量-计算方式-人群', '贮藏-温度-光照-湿度', '药品名称', '成分-分子式', '成分-分子量', '性状',
      '用法用量-起始剂量', '用法用量-每日剂量', '包装', '适应症-疾病类别', '成分-主要成分', '化学名称', '英文名', '效期','成分-辅料',
      '用法用量-给药频次-频次描述', '配伍浓度-溶媒药品', '用法用量-每日剂量-限制值', '用法用量-疾病名称', '中文名', '药品禁忌-诊断',
      '批准文号', '相互作用-其他', '用法用量-计算方式-体重', '汉语拼音', '执行标准', '注意事项-人群-用法用量', '生产企业',
      '药物禁忌-药品名称', '用法用量-疗程总剂量', '地址', '注意事项-人群-用法用量-初始计量', 'Tk', '用法用量-给药天数-高值',
      '成分-复方成分', '配伍浓度-溶媒药品-溶媒单位', '说明书核准日期', '电话',  '用法用量-计算方式-年龄', '药物禁忌-不推荐',
      '配伍浓度-溶质药品-溶质规格', '用法用量-计算方式-体表', '药物禁忌-药物类别', '给药途径', '说明书修改日期', '商品名',
      '配伍浓度-溶质药品', '配伍浓度-溶媒药品-溶媒规格', '用法用量-疾病状态-高值', '药品禁忌-诊断根据', '用法用量-计算方法-常规',
      '用法用量-起始剂量-限制量', '用法用量-每次剂量-限制量', '配伍浓度-溶质药品-溶质单位', '用法用量-围术期用药']


# 第二批数据有新增的标注类型 69+11=80
tags = ['不良反应-症状', '相互作用-结果', '相互作用-药品类别', '相互作用-药品名称', '适应症-诊断', '不良反应-引发疾病',
      '药物禁忌-禁用', '药物禁忌-慎用', '规格', '注意事项-检验相关', '用法用量-给药途径', '用法用量-每次剂量', '注意事项-操作',
      '用法用量-给药频次', '用法用量-计算方式-人群', '贮藏-温度-光照-湿度', '药品名称', '成分-分子式', '成分-分子量', '性状',
      '用法用量-起始剂量', '用法用量-每日剂量', '包装', '适应症-疾病类别', '成分-主要成分', '化学名称', '英文名', '效期','成分-辅料',
      '用法用量-给药频次-频次描述', '配伍浓度-溶媒药品', '用法用量-每日剂量-限制值', '用法用量-疾病名称', '中文名', '药品禁忌-诊断',
      '批准文号', '相互作用-其他', '用法用量-计算方式-体重', '汉语拼音', '执行标准', '注意事项-人群-用法用量', '生产企业',
      '药物禁忌-药品名称', '用法用量-疗程总剂量', '地址', '注意事项-人群-用法用量-初始计量', 'Tk', '用法用量-给药天数-高值',
      '成分-复方成分', '配伍浓度-溶媒药品-溶媒单位', '说明书核准日期', '电话',  '用法用量-计算方式-年龄', '药物禁忌-不推荐',
      '配伍浓度-溶质药品-溶质规格', '用法用量-计算方式-体表', '药物禁忌-药物类别', '给药途径', '说明书修改日期', '商品名',
      '配伍浓度-溶质药品', '配伍浓度-溶媒药品-溶媒规格', '用法用量-疾病状态-高值', '药品禁忌-诊断根据', '用法用量-计算方法-常规',
      '用法用量-起始剂量-限制量', '用法用量-每次剂量-限制量', '配伍浓度-溶质药品-溶质单位', '用法用量-围术期用药',
      '用法用量-疾病', '不良反应-症状-罕见', '贮藏条件', '注意事项-用法用量', '联系方式', '配伍-禁止', '注意事项-疾病', '用法用量-给药天数',
      '注册证号', '化学结构', '药物禁忌-疾病']



tag2label = {'O':0}
i = 1
for tag in tags:
    tag2label['S-' + tag] = i
    tag2label['B-' + tag] = i+1
    tag2label['I-' + tag] = i+2
    tag2label['E-' + tag] = i+3
    i = i + 4

label2tag = {}
for t,l in tag2label.items():
      label2tag[l] = t

pretrain_embedding = 'random'
UPDATE_EMBEDDINGS = True
USE_NORMALIZE = False
USE_CRF = True
SHUFFLE = True
BATCH_SIZE = 64
EPOCH = 100
HIDDEN_SIZE = 300
WORD_EMBEDDING_DIM = 300
KEEP_PRO = 0.5
LR = 0.001
CLIP_GRAD = 5.0


save_data = 'save_data_modifyTags/'
source_dir = 'data/source/annotation/'
xml2json = 'data/temp/SER.json'
ner_file = 'data/save/ner'
type_file = 'data/temp/type.json'
vocab_path_json = 'data/word2id.json'
vocab_path_pickle = 'data/word2id.pkl'